app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE (rating IN ('G','R')) ORDER BY release_date
---
  def index
    @order = params[:order]
    if @order
        if Movie.column_names.include? @order